canidate_app/react-canidate_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "gousbyt"], ["LIMIT", 1]]
---
    def handle_login username, password
      @user = User.find_by_username(username)