canidate_app/react-canidate_app/app/controllers/canidates_controller.rb

  def index
    @canidates = Canidate.all
---
SELECT "canidates".* FROM "canidates"